{
	"irn": "13064",
	"emuInput": {
		"ecatalogue_key": "53",
		"irn": "13064",
		"TitAccessionNo": "2001.35.6762",
		"TitMainTitle": "Soldiers in parade formation marching on street at intersection of Centre Avenue, in front of Thomas DeLuxe Ice Cream Bar, Centre Builders' Supply, Fifth Ward Honor Roll, and A. Leo Weil School, for fourth of July celebration by Soho Community Association, Centre Avenue, Hill District",
		"CreDateCreated": "July 4, 1945",
		"CreEarliestDate": "1945-07-04",
		"CreLatestDate": "1945-07-04",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of related image published in Pittsburgh Courier newspaper, July 7, 1945, pg. 13, reads: \"Our Boys - At Ease! - Members of the 4000th AAF Base Unit with sixty six-foot soldiers in full battle dress stand at ease while a throng of 10,000 persons who attended the Soho Community Association's Independence Day program listen to speakers at A. Leo Weil School in front of the Service Honor Roll. With the four captains from the 4000th AAF Base Unit added to the names of Capts. Charles Hall and William Thompson, a total of six captains were present.  Eleven Gold Star Mothers, a member of wounded Deshon Hospital veterans, outstanding political figures, national and local, were present.  Among other groups that participated were: Mounted Police, Indiantown Gap Band, National Guard Unit and Band, Drum and Bugle Corps (five), Forty-and-Eight, American Legion, Veterans of Foreign Wars, Auxiliary Police, Red Cross, and Elks Lodges.  These organizations had just completed a parade through the Hill District.\"",
		"CatSubject_tab": "Soldiers--Pennsylvania--Pittsburgh.\nParades--Pennsylvania--Pittsburgh.\nCrowds--Pennsylvania--Pittsburgh.\nBuildings--Pennsylvania--Pittsburgh.\nSigns--Pennsylvania--Pittsburgh.\nAdvertising--Pennsylvania--Pittsburgh.",
		"CreCountry_tab": "United States",
		"CreState_tab": "Pennsylvania",
		"CreDistrict_tab": "Allegheny county",
		"CreCity_tab": "Pittsburgh",
		"CrePlaceQualifier_tab": ""
	}
}