{
	"irn": "24274",
	"emuInput": {
		"ecatalogue_key": "115",
		"irn": "24274",
		"TitAccessionNo": "2001.35.14401",
		"TitMainTitle": "Men, women, one wearing leaf patterned dress, and children seated at banquet tables in Rodman Baptist Church for 80th Anniversary party",
		"CreDateCreated": "May 1965",
		"CreEarliestDate": "1965-05-01",
		"CreLatestDate": "1965-05-22",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of related image published in New Pittsburgh Courier newspaper, May 22, 1965, pg. 14 reads: \"Rodman Cites 50-Year Members - The closing feature of the 80th anniversary observance at Rodman Street Baptist Church, recently, was a banquet honoring members who had been faithful to the church for a half century or more. Active participants were (seated center) Rudolph Jeffries, speaker; Mrs. and the Rev. G.L. Bowick, Joseph Manker, toastmaster, and Linwood Gaskins, general chairman.  The honorees, looking none the worse for the years, were (seated, beginning left) Mmes. Lillie Yuille, Mary Gordon, Blanche Martin, Mary Gould, Ruth White, Ada Thurston, Maggie Edmonds, Ethel Senior, Mabel Stewart and Margaret Paxton.  Standing: Mrs. L. Bondurant, Mrs. M. Gibson, Mrs... Saunders, Mrs. F. Carroll, John Covington, Mmes. E. Watkins, M. Thomas, F. Woods, Lillian Loving, Mrs. Edna Mayo, Mmes. H. Brown, M. Redman and Sarah Smith.  Mr. and Mrs. William Frederick (back row second from right) were among the guests present.  honorees at this level are John Thomas (right), George Diggs.  Mrs. Estelle Allen and William Watson, left - Harris Photo.\"",
		"CatSubject_tab": "Men--Pennsylvania--Pittsburgh.\nWomen--Pennsylvania--Pittsburgh.\nChurches--Pennsylvania--Pittsburgh.\nAnniversary celebrations--Pennsylvania--Pittsburgh.\nRodman Street Baptist Church (Pittsburgh, Pa.)\nInteriors--Pennsylvania--Pittsburgh.",
		"CreCountry_tab": "United States",
		"CreState_tab": "",
		"CreDistrict_tab": "",
		"CreCity_tab": "",
		"CrePlaceQualifier_tab": ""
	}
}