{
	"irn": "27714",
	"emuInput": {
		"ecatalogue_key": "135",
		"irn": "27714",
		"TitAccessionNo": "2001.35.16958",
		"TitMainTitle": "Group portrait of clergy and church leaders, from left, seated: Rev. E. W. Gantt, Rev. E. F. Smith, Rev. Eugene E. Morgan, Bishop Stephen G. Spottswood, Rev. A. E. Harris, Rev. A.L. Pierce, and Rev. C. C. Nobles; standing: Rev. W. C. Ardrey, Dave Williamson, Rev. C. C. Ware, Willa Mae Rice, Mrs. B. F. Wright, P. L. Prattis, Rev. F. D. Porter, Rev. W. T. Kennedy, Rev. B. F. Wright, Rev. A. Nicholson, Rev. W. F. Moses, Rev. M. L. Banner, Rev. Allie Mae Johnson, Rev. L. Comer, Rev. A. L. Fuller, and Rev. Charles Foggie, posed in Wesley Center AME Zion Church for meeting on AMICO Corp.",
		"CreDateCreated": "April - May 1962",
		"CreEarliestDate": "1962-04-15",
		"CreLatestDate": "1962-05-05",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of image published in Pittsburgh Courier newspaper, May 5, 1962, pg. 12 reads: \"Bishop Maps \"AMIO\" Trust - Bishop S.G. Spottswood, seated fourth from left, met here this week with leaders of the four conferences of his Episcopal area for progress reports in the formation of the AMIO Corp. Participants, seated left to right, are: Revs. E.W. Gantt, Braddock; E.F. Smith, Erie; E.E. Morgan, Toledo, Ohio; Bishop Spottswood, Washington, D.C.; Revs. A.E. Harris and A.L. Pierce, Pittsburgh, and C.C. Nobles, Detroit, Mich. Standing : Rev. W.C. Ardrey, Detroit; Dave Williamson and Rev. C.C. Ware, Cleveland; Mrs. Willa Mae Rice, Pittsburgh;  Mrs. B.F. Wright, Toledo; P.L. Prattis, Pittsburgh; Rev. F.D. Porter, Detroit; W.T. Kennedy, Braddock; B.F. Wright, Toledo; A. Nicholson, Pittsburgh; W.F. Moses, Coraopolis; M.L. Banner, Erie; Rev. Allie Mae Johnson, Pittsburgh; L. Comer, Erie; Rev. A. L. Fuller, Cleveland, and Rev. C.H. Foggie, host pastor, Wesley Center AME Zion Church. - Harris Photo.\"",
		"CatSubject_tab": "Men--Pennsylvania--Pittsburgh.\nWomen--Pennsylvania--Pittsburgh.\nGroup portraits--Pennsylvania--Pittsburgh.\nStained glass--Pennsylvania--Pittsburgh.\nPianos--Pennsylvania--Pittsburgh.\nFoggie, Charles H. (Charles Herbert), 1912-2000.\nRice, Willa Mae.\nPrattis, P. L.\nWesley Center African Methodist Episcopal Zion Church (Pittsburgh, Pa.)\nPierce, A. L.\nNicholson, A.",
		"CreCountry_tab": "United States",
		"CreState_tab": "",
		"CreDistrict_tab": "",
		"CreCity_tab": "",
		"CrePlaceQualifier_tab": ""
	}
}