{
	"irn": "55468",
	"emuInput": {
		"ecatalogue_key": "239",
		"irn": "55468",
		"TitAccessionNo": "2001.35.42090",
		"TitMainTitle": "Joseph Givens, Walter C. Beckett, George H. Gould, Dr. Raymond E. Jackson, Henry D. Horner, Clarence C. Kittrell, and unknown standing behind banquet table, with others seated beside them including Julia Gaines third from left, William W. Grasty, John R. Bradford, Harry M. Montgomery, Henry M. Baysmore, Wilbur Douglass, Edward T. Bowser, Mayor David L. Lawrence, and others gathered for Masonic event at Syria Mosque",
		"CreDateCreated": "October 1953",
		"CreEarliestDate": "1953-10-01",
		"CreLatestDate": "1953-10-17",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of image published in Pittsburgh Courier newspaper, October 17, 1953, page 20, reads: \"Masonic Banquet Marks 'Prince Hall Day' - The Seventh Masonic District of Prince Hall Masons last Saturday at Syria Mosque feted delegates from other districts throughout the state, grated a plaque posthumously to Mrs. Julia Gaines, wife of the late Grand Master George W. Gaines, who died recently, and other plaques to former Past Grand Masters now living. Dr. Raymond E. Jackson, 33*, Imperial Potentate of the Ancient Egyptian Arabic Order of Nobles of the Mystic Shrine, shown standing in the center, was the main speaker. Standing behind him are the living Past Grand Masters who were honored. Left to right: Atty. Joseph Givens, 1945-46; Walter C. Beckett, 1923-33; George H. Gould, 1949-37, and Clarence C. Kittrell, 1923-24. Seated, from far left to far right, are: Mrs. Julia Gaines, who received the award posthumously for her late husband; William W. Grasty, Right Worshipful Deputy Grand Master and acting Grand Master, who was presented a hand-printed 'Scroll of Confidence and Respect from the District from District Deputy John R. Bradford, seated next to him; Hon. Harry M. Montgomery, judge of the Common Pleas Court; Henry M. Baysmore, State Grand Lecturer; Atty. Wilbur Douglass, Right Worshipful Grand Attorney; Edward T. Bowser, Past Grand Master of New Jersey, and David L. Lawrence, Mayor of the City of Pittsburgh, who brought greetings to the diners, on 'Prince Hall Day,' which he officially proclaimed. Also on hand were the following visiting Grand Masters: Walter C. Beckett of Philadelphia; Henry D. Horner of Philadelphia, and Clarence Kittrell of Erie. - Harris Photo.\"",
		"CatSubject_tab": "Group portraits--Pennsylvania--Pittsburgh.\nWomen--Pennsylvania--Pittsburgh.\nMen--Pennsylvania--Pittsburgh.\nBanquets--Pennsylvania--Pittsburgh.\nPaintings--Pennsylvania--Pittsburgh.\nFlags--Pennsylvania--Pittsburgh.\nPlants--Pennsylvania--Pittsburgh.\nGivens, Joseph.\nBeckett, Walter C.\nGould, George H.\nJackson, Raymond E.\nHorner, Henry D.\nKittrell, Clarence C.\nGaines, Julia.\nGrasty, William W.\nBradford, John R.\nMontgomery, Harry M.\nBaysmore, Henry M.\nDouglass, Wilbur.\nBowser, Edward T.\nLawrence, David Leo, 1889-1966.\nSyria Mosque (Pittsburgh, Pa.)\nFreemasons--Pennsylvania--Pittsburgh.",
		"CreCountry_tab": "United States",
		"CreState_tab": "",
		"CreDistrict_tab": "",
		"CreCity_tab": "",
		"CrePlaceQualifier_tab": ""
	}
}