{
	"irn": "6445",
	"emuInput": {
		"ecatalogue_key": "28",
		"irn": "6445",
		"TitAccessionNo": "2001.35.3874",
		"TitMainTitle": "Wanda Jackson, Mrs. John Hicks, Elmer Taylor, and police officer John Hicks, standing in hallway",
		"CreDateCreated": "June 15, 1949",
		"CreEarliestDate": "1949-06-15",
		"CreLatestDate": "1949-06-15",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of image published in Pittsburgh Courier newspaper, June 18, 1949, p. 4, reads: \"Accused Policemen Cleared by Trial Board -Officers' Wives Present...Picture above are Mrs. Karl C. [O.] Jackson, (left), Mrs. John Hicks, Elmer Taylor of Lee's Cleaners and officer Hicks.  Both wives seemed shy and retiring, but couldn't duck Courier cameraman, Tennie [Teenie] Harris, before picture was made. - Harris Photo.\"  Portion of accompanying article reads: \"Clark Watts Denies Politics Influenced Filing of Charges - Witnesses of All Races Crowd Trial Room; Wait Throughout Five-Hour Session to Defend Character of Officers Jackson and Hicks - 'Big Brass' of the city's police department, headed by Col. George E. A. Fairley, director of public safety, heard a public airing. Wednesday, of charges that two Hill District police officers were 'aiding and abetting hoodlumism' against a legitimate businessman whom they had allegedly tried to force into the rackets.  The hearing, attended my more than fifty Herron Avenue district businessmen and citizens brought together for the first time Officers Karl C. [O.] Jackson and John Hicks, and their accuser, Clark Watts.  Mrs. Watts is the owner of the Watts' Brothers Cleaner Shop, 2931 Wylie Avenue, an establishment he claimed was coveted by the officers who wished to use it for illegal and illicit purposes...\"",
		"CatSubject_tab": "Women--Pennsylvania--Pittsburgh.\nMen--Pennsylvania--Pittsburgh.\nInteriors--Pennsylvania--Pittsburgh.\nDresses--Pennsylvania--Pittsburgh.\nOffices--Pennsylvania--Pittsburgh.\nPolice officers--Pennsylvania--Pittsburgh.\nUniforms--Pennsylvania--Pittsburgh.\nDoorways--Pennsylvania--Pittsburgh.\nCourthouses--Pennsylvania--Pittsburgh.",
		"CreCountry_tab": "United States",
		"CreState_tab": "Pennsylvania",
		"CreDistrict_tab": "Allegheny county",
		"CreCity_tab": "Pittsburgh",
		"CrePlaceQualifier_tab": ""
	}
}