{
	"irn": "66303",
	"emuInput": {
		"ecatalogue_key": "342",
		"irn": "66303",
		"TitAccessionNo": "2001.35.52040",
		"TitMainTitle": "Group portrait of girl and boy, possibly best man James Johnson, groom Emanuel E. Thompson, bride Betty Lou Carter Thompson wearing floral gown and hennin, and possibly maid of honor Jacqueline Merchant, posed possibly in home at Waring Court, vertical format",
		"CreDateCreated": "May 2, 1953",
		"CreEarliestDate": "1953-05-02",
		"CreLatestDate": "1953-05-02",
		"PhyMediumComments": "black-and-white: Kodak safety film",
		"CatDescriptText": "Cutline of related image published in Pittsburgh Courier newspaper, May 16, 1953, pg. 5, reads: \"Mrs. Emanuel E. Thompson...Saturday's bride - Carter - Thompson Wedding - Betty Lou Carter, lovely daughter of Mrs. Myrtle Warren became the bride of Emanuel E. Thompson, son of Mrs. and Mrs. Glenn Thompson of Cliff Street, Saturday, May 2, at the home of her grandparents in Waring Court. The Rev. Jesse Moore, associate pastor of Central Baptist Church, officiated.  The bride is a former student of Wilberforce University and the groom is a veteran of Korea.  Beautiful Gown.  She wore a ballerina-length nylon tulle gown with a fitted bodice sprinkled with rhinestones.  Her unusual headpiece was a Fifteenth Century Renaissance crocheted cap, also sprinkled with rhinestones, attached to a fingertip-length veil edged with Chantilly lace.  She carried a white Bible pinned with an orchid.  Jacqueline Merchant, her maid of honor, wore a rose nylon net gown and had a corsage of American Beauty roses. Best man was James Johnson, a boyhood friend of the groom.  Lucille Jones directed the wedding, which was followed by a reception at Union Hall.\"",
		"CatSubject_tab": "Group portraits--Pennsylvania--Pittsburgh.\nWomen--Pennsylvania--Pittsburgh.\nBrides--Pennsylvania--Pittsburgh.\nWedding costume--Pennsylvania--Pittsburgh.\nMen--Pennsylvania--Pittsburgh.\nBridegrooms--Pennsylvania--Pittsburgh.\nInteriors--Pennsylvania--Pittsburgh.\nGirls--Pennsylvania--Pittsburgh.\nBoys--Pennsylvania--Pittsburgh.\nEyeglasses--Pennsylvania--Pittsburgh.",
		"CreCountry_tab": "United States",
		"CreState_tab": "",
		"CreDistrict_tab": "",
		"CreCity_tab": "",
		"CrePlaceQualifier_tab": ""
	}
}